michal-narajowski/mynewt-nimble/porting/examples/freertos_nrf5_sdk/hci_uart_nrf5_sdk.c
    /*
     * XXX: note that for host only there would be no need to allocate
     * a user header. Address this later.
     */
    m = os_mbuf_get_pkthdr(&ble_hci_uart_acl_mbuf_pool,
                           sizeof(struct ble_mbuf_hdr));
    return m;
}

static int
ble_hci_uart_acl_tx(struct os_mbuf *om)
{
    struct ble_hci_uart_pkt *pkt;
    os_sr_t sr;

    /* If this packet is zero length, just free it */
    if (OS_MBUF_PKTLEN(om) == 0) {
        os_mbuf_free_chain(om);
        return 0;
    }

    pkt = os_memblock_get(&ble_hci_uart_pkt_pool);
    if (pkt == NULL) {
        os_mbuf_free_chain(om);
        return BLE_ERR_MEM_CAPACITY;
    }

    pkt->type = BLE_HCI_UART_H4_ACL;
    pkt->data = om;

    OS_ENTER_CRITICAL(sr);
    STAILQ_INSERT_TAIL(&ble_hci_uart_state.tx_pkts, pkt, next);
    OS_EXIT_CRITICAL(sr);

    tx_single_char();

    return 0;
}

static int
ble_hci_uart_cmdevt_tx(uint8_t *hci_ev, uint8_t h4_type)
{
    struct ble_hci_uart_pkt *pkt;
    os_sr_t sr;

    pkt = os_memblock_get(&ble_hci_uart_pkt_pool);
    if (pkt == NULL) {
        ble_hci_trans_buf_free(hci_ev);
        return BLE_ERR_MEM_CAPACITY;
    }

    pkt->type = h4_type;
    pkt->data = hci_ev;

    OS_ENTER_CRITICAL(sr);
    STAILQ_INSERT_TAIL(&ble_hci_uart_state.tx_pkts, pkt, next);
    OS_EXIT_CRITICAL(sr);

    tx_single_char();

    return 0;
}

/**
 * @return                      The packet type to transmit on success;
 *                              -1 if there is nothing to send.
 */
static int
ble_hci_uart_tx_pkt_type(void)
{
    struct ble_hci_uart_pkt *pkt;
    struct os_mbuf *om;
    os_sr_t sr;
    int rc;

    OS_ENTER_CRITICAL(sr);

    pkt = STAILQ_FIRST(&ble_hci_uart_state.tx_pkts);
    if (!pkt) {
        OS_EXIT_CRITICAL(sr);
        return -1;
    }

    STAILQ_REMOVE(&ble_hci_uart_state.tx_pkts, pkt, ble_hci_uart_pkt, next);

    OS_EXIT_CRITICAL(sr);

    rc = pkt->type;
    switch (pkt->type) {
    case BLE_HCI_UART_H4_CMD:
        ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_CMD;
        ble_hci_uart_state.tx_cmd.data = pkt->data;
        ble_hci_uart_state.tx_cmd.cur = 0;
        ble_hci_uart_state.tx_cmd.len = ble_hci_uart_state.tx_cmd.data[2] +
                                        BLE_HCI_CMD_HDR_LEN;
        break;

    case BLE_HCI_UART_H4_EVT:
        ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_EVT;
        ble_hci_uart_state.tx_cmd.data = pkt->data;
        ble_hci_uart_state.tx_cmd.cur = 0;
        ble_hci_uart_state.tx_cmd.len = ble_hci_uart_state.tx_cmd.data[1] +
                                        BLE_HCI_EVENT_HDR_LEN;
        break;

    case BLE_HCI_UART_H4_ACL:
        ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_ACL;
        om = (struct os_mbuf *)pkt->data;
        /* NOTE: first mbuf must have non-zero length */
        os_mbuf_trim_front(om);
        ble_hci_uart_state.tx_pkt.tx_acl = om;
        ble_hci_uart_state.tx_pkt.dptr = om->om_data;
        ble_hci_uart_state.rem_tx_len = OS_MBUF_PKTLEN(om);
        break;

    default:
        rc = -1;
        break;
    }

    os_memblock_put(&ble_hci_uart_pkt_pool, pkt);

    return rc;
}

/**
 * @return                      The byte to transmit on success;
 *                              -1 if there is nothing to send.
 */
static int
ble_hci_uart_tx_char(void *arg)
{
    uint8_t u8;
    int rc;
    struct os_mbuf *om;

    switch (ble_hci_uart_state.tx_type) {
    case BLE_HCI_UART_H4_NONE: /* No pending packet, pick one from the queue */
        rc = ble_hci_uart_tx_pkt_type();
        break;

    case BLE_HCI_UART_H4_CMD:
    case BLE_HCI_UART_H4_EVT:
        rc = ble_hci_uart_state.tx_cmd.data[ble_hci_uart_state.tx_cmd.cur++];

        if (ble_hci_uart_state.tx_cmd.cur == ble_hci_uart_state.tx_cmd.len) {
            ble_hci_trans_buf_free(ble_hci_uart_state.tx_cmd.data);
            ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_NONE;
        }
        break;

    case BLE_HCI_UART_H4_ACL:
        /* Copy the first unsent byte from the tx buffer and remove it from the
         * source.
         */
        u8 = ble_hci_uart_state.tx_pkt.dptr[0];
        --ble_hci_uart_state.rem_tx_len;
        if (ble_hci_uart_state.rem_tx_len == 0) {
            os_mbuf_free_chain(ble_hci_uart_state.tx_pkt.tx_acl);
            ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_NONE;
        } else {
            om = ble_hci_uart_state.tx_pkt.tx_acl;
            --om->om_len;
            if (om->om_len == 0) {
                /* Remove and free any zero mbufs */
                while ((om != NULL) && (om->om_len == 0)) {
                    ble_hci_uart_state.tx_pkt.tx_acl = SLIST_NEXT(om, om_next);
                    os_mbuf_free(om);
                    om = ble_hci_uart_state.tx_pkt.tx_acl;
                }
                /* NOTE: om should never be NULL! What to do? */
                if (om == NULL) {
                    assert(0);
                    ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_NONE;
                } else {
                    ble_hci_uart_state.tx_pkt.dptr = om->om_data;
                }
            } else {
                ble_hci_uart_state.tx_pkt.dptr++;
            }
        }
        rc = u8;
        break;
    default:
        rc = -1;
        break;
    }

    return rc;
}

#if MYNEWT_VAL(BLE_DEVICE)
/**
 * HCI uart sync lost.
 *
 * This occurs when the controller receives an invalid packet type or a length
 * field that is out of range. The controller needs to send a HW error to the
 * host and wait to find a LL reset command.
 */
static void
ble_hci_uart_sync_lost(void)
{
    ble_hci_uart_state.rx_cmd.len = 0;
    ble_hci_uart_state.rx_cmd.cur = 0;
    ble_hci_uart_state.rx_cmd.data =
        ble_hci_trans_buf_alloc(BLE_HCI_TRANS_BUF_CMD);
    ble_ll_hw_error(BLE_HW_ERR_HCI_SYNC_LOSS);
    ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_SYNC_LOSS;
}
#endif

/**
 * @return                      The type of packet to follow success;
 *                              -1 if there is no valid packet to receive.
 */
static int
ble_hci_uart_rx_pkt_type(uint8_t data)
{
    struct os_mbuf *m;

    ble_hci_uart_state.rx_type = data;

    switch (ble_hci_uart_state.rx_type) {
    /* Host should never receive a command! */
#if MYNEWT_VAL(BLE_DEVICE)
    case BLE_HCI_UART_H4_CMD:
        ble_hci_uart_state.rx_cmd.len = 0;
        ble_hci_uart_state.rx_cmd.cur = 0;
        ble_hci_uart_state.rx_cmd.data =
            ble_hci_trans_buf_alloc(BLE_HCI_TRANS_BUF_CMD);
        if (ble_hci_uart_state.rx_cmd.data == NULL) {
            ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_SKIP_CMD;
        }
        break;
#endif

        /* Controller should never receive an event */
#if MYNEWT_VAL(BLE_HOST)
    case BLE_HCI_UART_H4_EVT:
        /*
         * XXX: we should not assert if host cannot allocate an event. Need
         * to determine what to do here.
         */
        ble_hci_uart_state.rx_cmd.data =
            ble_hci_trans_buf_alloc(BLE_HCI_TRANS_BUF_EVT_HI);
        assert(ble_hci_uart_state.rx_cmd.data != NULL);

