michal-narajowski/mynewt-nimble/porting/examples/freertos_nrf5_sdk/hci_uart_nrf5_sdk.c
        ble_hci_uart_state.rx_cmd.len = 0;
        ble_hci_uart_state.rx_cmd.cur = 0;
        break;
#endif

    case BLE_HCI_UART_H4_ACL:
        ble_hci_uart_state.rx_acl.len = 0;
        ble_hci_uart_state.rx_acl.rxd_bytes = 0;
        m = ble_hci_trans_acl_buf_alloc();
        if (m) {
            ble_hci_uart_state.rx_acl.dptr = m->om_data;
        } else {
            ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_SKIP_ACL;
        }
        ble_hci_uart_state.rx_acl.buf = m;
        break;

    default:
#if MYNEWT_VAL(BLE_DEVICE)
        /*
         * If we receive an unknown HCI packet type this is considered a loss
         * of sync.
         */
        ble_hci_uart_sync_lost();
#else
        /*
         * XXX: not sure what to do about host in this case. Just go back to
         * none for now.
         */
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
#endif
        break;
    }

    return 0;
}

#if MYNEWT_VAL(BLE_DEVICE)
/**
 * HCI uart sync loss.
 *
 * Find a LL reset command in the byte stream. The LL reset command is a
 * sequence of 4 bytes:
 *  0x01    HCI Packet Type = HCI CMD
 *  0x03    OCF for reset command
 *  0x0C    OGF for reset command (0x03 shifted left by two bits as the OGF
 *          occupies the uopper 6 bits of this byte.
 *  0x00    Parameter length of reset command (no parameters).
 *
 * @param data Byte received over serial port
 */
void
ble_hci_uart_rx_sync_loss(uint8_t data)
{
    int rc;
    int index;

    /*
     * If we couldnt allocate a command buffer (should not occur but
     * possible) try to allocate one on each received character. If we get
     * a reset and buffer is not available we have to ignore reset.
     */
    if (ble_hci_uart_state.rx_cmd.data == NULL) {
        ble_hci_uart_state.rx_cmd.data =
            ble_hci_trans_buf_alloc(BLE_HCI_TRANS_BUF_CMD);
    }

    index = ble_hci_uart_state.rx_cmd.cur;
    if (data == ble_hci_uart_reset_cmd[index]) {
        if (index == 3) {
            if (ble_hci_uart_state.rx_cmd.data == NULL) {
                index = 0;
            } else {
                assert(ble_hci_uart_rx_cmd_cb != NULL);
                ble_hci_uart_state.rx_cmd.data[0] = 0x03;
                ble_hci_uart_state.rx_cmd.data[1] = 0x0C;
                ble_hci_uart_state.rx_cmd.data[2] = 0x00;
                rc = ble_hci_uart_rx_cmd_cb(ble_hci_uart_state.rx_cmd.data,
                                            ble_hci_uart_rx_cmd_arg);
                if (rc != 0) {
                    ble_hci_trans_buf_free(ble_hci_uart_state.rx_cmd.data);
                }
                ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
            }
        } else {
            ++index;
        }
    } else {
        index = 0;
    }

    ble_hci_uart_state.rx_cmd.cur = index;
}

static void
ble_hci_uart_rx_cmd(uint8_t data)
{
    int rc;

    ble_hci_uart_state.rx_cmd.data[ble_hci_uart_state.rx_cmd.cur++] = data;

    if (ble_hci_uart_state.rx_cmd.cur < BLE_HCI_CMD_HDR_LEN) {
        return;
    }

    if (ble_hci_uart_state.rx_cmd.cur == BLE_HCI_CMD_HDR_LEN) {
        ble_hci_uart_state.rx_cmd.len = ble_hci_uart_state.rx_cmd.data[2] +
                                         BLE_HCI_CMD_HDR_LEN;
    }

    if (ble_hci_uart_state.rx_cmd.cur == ble_hci_uart_state.rx_cmd.len) {
        assert(ble_hci_uart_rx_cmd_cb != NULL);
        rc = ble_hci_uart_rx_cmd_cb(ble_hci_uart_state.rx_cmd.data,
                                    ble_hci_uart_rx_cmd_arg);
        if (rc != 0) {
            ble_hci_trans_buf_free(ble_hci_uart_state.rx_cmd.data);
        }
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
    }
}

static void
ble_hci_uart_rx_skip_cmd(uint8_t data)
{
    ble_hci_uart_state.rx_cmd.cur++;

    if (ble_hci_uart_state.rx_cmd.cur < BLE_HCI_CMD_HDR_LEN) {
        return;
    }

    if (ble_hci_uart_state.rx_cmd.cur == BLE_HCI_CMD_HDR_LEN) {
        ble_hci_uart_state.rx_cmd.len = data + BLE_HCI_CMD_HDR_LEN;
    }

    if (ble_hci_uart_state.rx_cmd.cur == ble_hci_uart_state.rx_cmd.len) {
        /*
         * XXX: for now we simply skip the command and do nothing. This
         * should not happen but at least we retain HCI synch. The host
         * can decide what to do in this case. It may be appropriate for
         * the controller to attempt to send back a command complete or
         * command status in this case.
         */
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
    }
}
#endif

#if MYNEWT_VAL(BLE_HOST)
static void
ble_hci_uart_rx_evt(uint8_t data)
{
    int rc;

    ble_hci_uart_state.rx_cmd.data[ble_hci_uart_state.rx_cmd.cur++] = data;

    if (ble_hci_uart_state.rx_cmd.cur < BLE_HCI_EVENT_HDR_LEN) {
        return;
    }

    if (ble_hci_uart_state.rx_cmd.cur == BLE_HCI_EVENT_HDR_LEN) {
        ble_hci_uart_state.rx_cmd.len = ble_hci_uart_state.rx_cmd.data[1] +
                                        BLE_HCI_EVENT_HDR_LEN;
    }

    if (ble_hci_uart_state.rx_cmd.cur == ble_hci_uart_state.rx_cmd.len) {
        assert(ble_hci_uart_rx_cmd_cb != NULL);
        rc = ble_hci_uart_rx_cmd_cb(ble_hci_uart_state.rx_cmd.data,
                                    ble_hci_uart_rx_cmd_arg);
        if (rc != 0) {
            ble_hci_trans_buf_free(ble_hci_uart_state.rx_cmd.data);
        }
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
    }
}
#endif

static void
ble_hci_uart_rx_acl(uint8_t data)
{
    uint16_t rxd_bytes;
    uint16_t pktlen;

    rxd_bytes = ble_hci_uart_state.rx_acl.rxd_bytes;
    ble_hci_uart_state.rx_acl.dptr[rxd_bytes] = data;
    ++rxd_bytes;
    ble_hci_uart_state.rx_acl.rxd_bytes = rxd_bytes;

    if (rxd_bytes < BLE_HCI_DATA_HDR_SZ) {
        return;
    }

    if (rxd_bytes == BLE_HCI_DATA_HDR_SZ) {
        pktlen = ble_hci_uart_state.rx_acl.dptr[3];
        pktlen = (pktlen << 8) + ble_hci_uart_state.rx_acl.dptr[2];
        ble_hci_uart_state.rx_acl.len = pktlen + BLE_HCI_DATA_HDR_SZ;

        /*
         * Data portion cannot exceed data length of acl buffer. If it does
         * this is considered to be a loss of sync.
         */
        if (pktlen > ble_hci_uart_max_acl_datalen) {
            os_mbuf_free_chain(ble_hci_uart_state.rx_acl.buf);
#if MYNEWT_VAL(BLE_DEVICE)
            ble_hci_uart_sync_lost();
#else
        /*
         * XXX: not sure what to do about host in this case. Just go back to
         * none for now.
         */
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
#endif
        }
    }

    if (rxd_bytes == ble_hci_uart_state.rx_acl.len) {
        assert(ble_hci_uart_rx_acl_cb != NULL);
        /* XXX: can this callback fail? What if it does? */
        OS_MBUF_PKTLEN(ble_hci_uart_state.rx_acl.buf) = rxd_bytes;
        ble_hci_uart_state.rx_acl.buf->om_len = rxd_bytes;
        ble_hci_uart_rx_acl_cb(ble_hci_uart_state.rx_acl.buf,
                               ble_hci_uart_rx_acl_arg);
        ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;
    }
}

static void
ble_hci_uart_rx_skip_acl(uint8_t data)
{
    uint16_t rxd_bytes;
    uint16_t pktlen;

    rxd_bytes = ble_hci_uart_state.rx_acl.rxd_bytes;
    ++rxd_bytes;
    ble_hci_uart_state.rx_acl.rxd_bytes = rxd_bytes;

    if (rxd_bytes == (BLE_HCI_DATA_HDR_SZ - 1)) {
        ble_hci_uart_state.rx_acl.len = data;
        return;
    }

