michal-narajowski/mynewt-nimble/porting/examples/freertos_nrf5_sdk/hci_uart_nrf5_sdk.c
    if (nrf_drv_uart_tx_in_progress(&uart_inst)) {
        return;
    }

    ret = ble_hci_uart_tx_char(NULL);
    if (ret < 0) {
        return;
    }

    c = ret;
    nrf_drv_uart_tx(&uart_inst, &c, 1);
}

static void uart_event_handler(nrf_drv_uart_event_t * p_event, void* p_context)
{
    BaseType_t xHigherPriorityTaskWoken;
    ret_code_t ret;

    if (p_event->type == NRF_DRV_UART_EVT_RX_DONE) {
        if (uart_rx_index == UART_RX_BUFFER_SIZE) {
            uart_rx_index = 0;
        }

        /* Trigger RX for next character */
        ret = nrf_drv_uart_rx(&uart_inst, &uart_rx_buf[uart_rx_index++], 1);
        assert(ret == NRF_SUCCESS);

        if (++uart_rx_tail == UART_RX_BUFFER_SIZE) {
            uart_rx_tail = 0;
        }

        assert(uart_rx_tail != uart_rx_head);

        xTaskNotifyFromISR(uart_task_h, 1, eSetBits,
                           &xHigherPriorityTaskWoken);
        portYIELD_FROM_ISR(xHigherPriorityTaskWoken);
    } else if (p_event->type == NRF_DRV_UART_EVT_ERROR) {
        assert(0);
    } else if (p_event->type == NRF_DRV_UART_EVT_TX_DONE) {
        tx_single_char();
    }
}

static int
ble_hci_uart_config(void)
{
    ret_code_t ret;

    nrf_drv_uart_config_t config = NRF_DRV_UART_DEFAULT_CONFIG;
    config.baudrate = NRF_UART_BAUDRATE_115200;
    config.hwfc = NRF_UART_HWFC_DISABLED;
    config.parity = NRF_UART_PARITY_EXCLUDED;
    config.pselcts = NRF_UART_PSEL_DISCONNECTED;
    config.pselrts = NRF_UART_PSEL_DISCONNECTED;
    config.pselrxd = 8;
    config.pseltxd = 6;
    config.interrupt_priority = 1;
    int err_code = nrf_drv_uart_init(&uart_inst, &config, uart_event_handler);
    assert(err_code == NRF_SUCCESS);

    uart_rx_head = 0;
    uart_rx_tail = 0;
    uart_rx_index = 0;
    ret = nrf_drv_uart_rx(&uart_inst, &uart_rx_buf[uart_rx_index++], 1);
    assert(ret == NRF_SUCCESS);
    ret = nrf_drv_uart_rx(&uart_inst, &uart_rx_buf[uart_rx_index++], 1);
    assert(ret == NRF_SUCCESS);

    return 0;
}

int
ble_hci_trans_reset(void)
{
    struct ble_hci_uart_pkt *pkt;
    int rc;

    nrf_drv_uart_uninit(&uart_inst);

    ble_hci_uart_free_pkt(ble_hci_uart_state.rx_type,
                          ble_hci_uart_state.rx_cmd.data,
                          ble_hci_uart_state.rx_acl.buf);
    ble_hci_uart_state.rx_type = BLE_HCI_UART_H4_NONE;

    ble_hci_uart_free_pkt(ble_hci_uart_state.tx_type,
                          ble_hci_uart_state.tx_cmd.data,
                          ble_hci_uart_state.tx_pkt.tx_acl);
    ble_hci_uart_state.tx_type = BLE_HCI_UART_H4_NONE;

    while ((pkt = STAILQ_FIRST(&ble_hci_uart_state.tx_pkts)) != NULL) {
        STAILQ_REMOVE(&ble_hci_uart_state.tx_pkts, pkt, ble_hci_uart_pkt,
                      next);
        ble_hci_uart_free_pkt(pkt->type, pkt->data, pkt->data);
        os_memblock_put(&ble_hci_uart_pkt_pool, pkt);
    }

    rc = ble_hci_uart_config();
    if (rc != 0) {
        return rc;
    }

    return 0;
}

static void uart_task_fn (void * pvParameter)
{
    uint32_t nv;
    int t;

    while (1) {
        portENTER_CRITICAL();
        t = uart_rx_tail;
        portEXIT_CRITICAL();

        if (uart_rx_head == t) {
            xTaskNotifyWait(0, 0xffffffff, &nv, portMAX_DELAY);
            if (!(nv & 1)) {
                continue;
            }
        }

        ble_hci_uart_rx_char(NULL, uart_rx_buf[uart_rx_head]);

        portENTER_CRITICAL();
        if (++uart_rx_head == UART_RX_BUF_SIZE) {
            uart_rx_head = 0;
        }
        portEXIT_CRITICAL();
    }
}

void
ble_hci_transport_init(void)
{
    int acl_data_length;
    int acl_block_size;
    int rc;

    /* Ensure this function only gets called by sysinit. */
    SYSINIT_ASSERT_ACTIVE();

    /*
     * The MBUF payload size must accommodate the HCI data header size plus the
     * maximum ACL data packet length. The ACL block size is the size of the
     * mbufs we will allocate.
     */
    acl_data_length = MYNEWT_VAL(BLE_ACL_BUF_SIZE);
    ble_hci_uart_max_acl_datalen = acl_data_length;
    acl_block_size = acl_data_length + BLE_MBUF_MEMBLOCK_OVERHEAD +
        BLE_HCI_DATA_HDR_SZ;
    acl_block_size = OS_ALIGN(acl_block_size, OS_ALIGNMENT);
    rc = mem_malloc_mempool(&ble_hci_uart_acl_pool,
                            MYNEWT_VAL(BLE_ACL_BUF_COUNT),
                            acl_block_size,
                            "ble_hci_uart_acl_pool",
                            &ble_hci_uart_acl_buf);
    SYSINIT_PANIC_ASSERT(rc == 0);

    rc = os_mbuf_pool_init(&ble_hci_uart_acl_mbuf_pool, &ble_hci_uart_acl_pool,
                           acl_block_size, MYNEWT_VAL(BLE_ACL_BUF_COUNT));
    SYSINIT_PANIC_ASSERT(rc == 0);

    /*
     * Create memory pool of HCI command buffers. NOTE: we currently dont
     * allow this to be configured. The controller will only allow one
     * outstanding command. We decided to keep this a pool in case we allow
     * allow the controller to handle more than one outstanding command.
     */
    rc = mem_malloc_mempool(&ble_hci_uart_cmd_pool,
                            1,
                            BLE_HCI_TRANS_CMD_SZ,
                            "ble_hci_uart_cmd_pool",
                            &ble_hci_uart_cmd_buf);
    SYSINIT_PANIC_ASSERT(rc == 0);

    rc = mem_malloc_mempool(&ble_hci_uart_evt_hi_pool,
                            MYNEWT_VAL(BLE_HCI_EVT_HI_BUF_COUNT),
                            MYNEWT_VAL(BLE_HCI_EVT_BUF_SIZE),
                            "ble_hci_uart_evt_hi_pool",
                            &ble_hci_uart_evt_hi_buf);
    SYSINIT_PANIC_ASSERT(rc == 0);

    rc = mem_malloc_mempool(&ble_hci_uart_evt_lo_pool,
                            MYNEWT_VAL(BLE_HCI_EVT_LO_BUF_COUNT),
                            MYNEWT_VAL(BLE_HCI_EVT_BUF_SIZE),
                            "ble_hci_uart_evt_lo_pool",
                            &ble_hci_uart_evt_lo_buf);
    SYSINIT_PANIC_ASSERT(rc == 0);

    /*
     * Create memory pool of packet list nodes. NOTE: the number of these
     * buffers should be, at least, the total number of event buffers (hi
     * and lo), the number of command buffers (currently 1) and the total
     * number of buffers that the controller could possibly hand to the host.
     */
    rc = mem_malloc_mempool(&ble_hci_uart_pkt_pool,
                            BLE_HCI_UART_EVT_COUNT + 1 +
                                MYNEWT_VAL(BLE_HCI_ACL_OUT_COUNT),
                            sizeof (struct ble_hci_uart_pkt),
                            "ble_hci_uart_pkt_pool",
                            &ble_hci_uart_pkt_buf);
    SYSINIT_PANIC_ASSERT(rc == 0);

    xTaskCreate(uart_task_fn, "uart", configMINIMAL_STACK_SIZE, NULL, 2,
                &uart_task_h);

    rc = ble_hci_uart_config();
    SYSINIT_PANIC_ASSERT_MSG(rc == 0, "Failure configuring UART HCI");

    memset(&ble_hci_uart_state, 0, sizeof ble_hci_uart_state);
    STAILQ_INIT(&ble_hci_uart_state.tx_pkts);
}
